Repository: landis-neuropsicologia/Titan
Catalog: src/Titan.Domain/Properties/Resources.*.resx
Languages: pt_br

# UserStatus_Active
source: Active
pt_br: Ativo

# UserStatus_Deleted
source: Deleted
pt_br: Excluído

# UserStatus_Expired
source: Expired
pt_br: Expirado

# UserStatus_ExpiresAt
source: Expires at
pt_br: Expira em

# UserStatus_Inactive
source: Inactive
pt_br: Inativo

# UserStatus_Locked
source: Locked
pt_br: Bloqueado

# UserStatus_Pending
source: Pending
pt_br: Pendente

# UserStatus_Suspended
source: Suspended
pt_br: Suspenso

# UserStatus_WithExpiration
source: Expiration date must be in the future.
pt_br: Data de Expiração precisa ser maior que Data Atual.

# UserStatus_WithReason
source: Reason cannot be empty.
pt_br: O campo Reason não pode ser vazio.

# UserBase_EmailEmpty
source: Email cannot be null or empty.
pt_br: O campo Email não pode ser vazio.

# UserBase_RoleEmpty
source: Role cannot be null or empty.
pt_br: O campo Role não pode ser vazio.

# UserStatus_CreateDeleted
source: Reason is required for deleted status.
pt_br: É necessário informar o 'reason'.

# UserStatus_CreateLocked
source: Reason is required for locked status.
pt_br: É necessário informar o 'reason'.

# UserStatus_CreateSuspended
source: Reason is required for suspended status.
pt_br: É necessário informar o 'reason'.

# UserStatus_Unknown
source: Unknown status type:
pt_br: Status Desconhecido:

# SocialMediaProvider_UnsupportedProvider
source: Unsupported social media provider:
pt_br: Provedor de Mídia Social não suportado:

# PhoneNumber_Empty
source: Phone number cannot be empty.
pt_br: Telefone não pode ser vazio.

# PhoneNumber_InternationalNumberInvalid
source: Invalid international phone number format.
pt_br: Telefone com formato internacional inválido.

# PhoneNumber_NationalNumberInvalid
source: Invalid phone number format.
pt_br: Telefone com formato inválido.

# PhoneNumber_ToE164Format
source: Cannot convert to E.164 format without country code.
pt_br: Não é possível converter para o formato E.164 sem o código do país.

# PasswordHash_Empty
source: Password cannot be empty.
pt_br: A Senha não pode ser vazia.

# PasswordHash_HashEmpty
source: Hash value cannot be empty.
pt_br: O Hash não pode ser vazio.

# Name_Empty
source: Name cannot be null or empty.
pt_br: O Nome não pode ser vazio.

# Name_TooLong
source: Name is too long.
pt_br: O Nome é muito grande.

# JobTitle_Empty
source: Job title cannot be empty.
pt_br: Cargo não pode ser vazio.

# JobTitle_LevelNegative
source: Level cannot be negative.
pt_br: Nível não pode ser negativo.

# JobTitle_AbbreviationNegative
source: Abbreviation cannot be empty.
pt_br: Abreviação não pode ser vazio.

# JobTitle_DepartmentEmpty
source: Department cannot be empty.
pt_br: Departamento não pode ser vazio.

# JobTitle_UnknownAbbreviation
source: Unknown job title abbreviation:
pt_br: Abreviação desconhecida.

# EmployeeId_Empty
source: Employee ID cannot be empty.
pt_br: Employee ID não pode ser vazio.

# EmployeeId_TooLong
source: Employee ID is too long.
pt_br: Employee ID é muito grande.

# Email_Empty
source: Email cannot be null or empty.
pt_br: Email não pode ser vazio.

# Email_TooLong
source: Email is too long.
pt_br: Email é muito grande.

# Email_Invalid
source: Email is invalid.
pt_br: Email inválido.

# DomainName_TooLong
source: Domain is too long.
pt_br: Nome do Dominio é muito grande.

# DomainName_EmptyPeriod
source: Domain must contain at least one period.
pt_br: Nome do Dominio precisa ter ao menos um período.

# DateRange_GreaterThan
source: End date must be equal to or greater than start date.
pt_br: Data Final precisa ser maior ou igual a Data Inicial.

# DateRange_Negative
source: Duration cannot be negative.
pt_br: Duração não pode ser negativo.

# DateRange_DaysNotNegative
source: Number of days cannot be negative.
pt_br: Número de Dias não pode ser negativo.

# DateRange_Intersect
source: Cannot intersect non-overlapping date ranges.
pt_br: Não é possível cruzar intervalos de datas não sobrepostos.

# DateRange_Union
source: Cannot union non-overlapping date ranges.
pt_br: Não é possível unir intervalos de datas não sobrepostos.

# DateRange_Split
source: Interval must be positive.
pt_br: O intervalo deve ser positivo.

# Currency_Empty
source: Currency code cannot be empty.
pt_br: Código da Moeda não pode ser vazio.

# Currency_Add
source: Cannot add currencies with different codes:
pt_br: Não é possível adicionar moedas com códigos diferentes:

# Currency_Divide
source: Cannot divide by zero.
pt_br: Divisão por zero.

# Currency_Subtract
source: Cannot subtract currencies with different codes:
pt_br: Não é possível subtrair moedas com códigos diferentes:

# Currency_And
source: and
pt_br: e

# Currency_ValueEmpty
source: Value cannot be empty.
pt_br: Valor não pode ser vazio.

# Currency_InvalidValue
source: Invalid monetary value.
pt_br: Valor monetário inválido.

# CompositeRoleName_RoleEmpty
source: At least one role name must be provided.
pt_br: Pelo menos uma role deve ser fornecida.

# CompositeRoleName_RoleName
source: Role name cannot be empty.
pt_br: O Nome da Role não pode ser vazio.

# CompositeRoleName_Remove
source: Cannot remove the last role from a composite role.
pt_br: Não é possível remover a última role de uma role composta.

# CompositeRoleName_CompositeRoleEmpty
source: Composite role name cannot be empty.
pt_br: O nome da role composta não pode estar vazio.

# CompositeRoleName_Intersect
source: Role intersection resulted in empty set.
pt_br: A intersecção de roles resultou em um conjunto vazio.

# Address_StreetEmpty
source: Street cannot be empty.
pt_br: Rua não pode ser vazio.

# Address_ZipEmpty
source: Zip code cannot be empty.
pt_br: Código Postal não pode ser vazio.

# Address_StateEmpty
source: State cannot be empty.
pt_br: Estado não pode ser vazio.

# Address_CityEmpty
source: City cannot be empty.
pt_br: Cidade não pode ser vazio.

# Address_CountryEmpty
source: Country cannot be empty.
pt_br: País não pode ser vazio.

# Address_NumberEmpty
source: Number cannot be empty.
pt_br: Número não pode ser vazio.

# ActivationKey_Empty
source: Activation key cannot be empty.
pt_br: Chave de Ativação não pode ser vazia.

# TaxNumber_Empty
source: Tax Number cannot be empty.
pt_br: O CPF/CNPJ não pode ser vazio.

# Role_Empty
source: Role name cannot be null or empty.
pt_br: O Nome da Role não pode ser vazio.

# Company_Empty
source: Company name cannot be null or empty.
pt_br: O Nome da Empresa não pode ser vazio.

# CompanyUser_Empty
source: Company name cannot be null or empty.
pt_br: O Nome da Empresa não pode ser vazio.

# ActivityLog_ActionEmpty
source: Action cannot be null or empty.
pt_br: Acão não pode ser vazio.

# ActivityLog_UserIdEmpty
source: User ID cannot be empty.
pt_br: User ID não pode ser vazio.

# StaffUser_NameEmpty
source: Name cannot be null or empty.
pt_br: Nome não pode ser vazio.

# PersonUser_NameEmpty
source: Name cannot be null or empty.
pt_br: Nome não pode ser vazio.

# StaffUser_EmployeeIdEmpty
source: Employee ID cannot be null or empty.
pt_br: ID do Colaborador não pode ser vazio.
